<template>
  <div>
    <p>
      PeerConnection是WebRTC的心脏，也是最难实现最难理解的部分。从某种程度上来说，它可以做任何事情。
    </p>

    <p># 它处理所有的SDP消息交换过程（不通过网络本身发送，而是生成他们并处理输入的消息）</p>

    <p># 它实现ICE以连接媒体通道，如果需要的话，要通过TURN中继。</p>

    <p># 它实时地对音视频数据进行编码和解码</p>

    <p>
      #
      它通过采用自适应的抖动缓冲区，带宽估计，数据丢包隐藏，前向纠错以及其他算法来处理网络问题，这些算法你并不想了解，但往往最终必须要学习它们。
    </p>

    <p># 它使用诸如回声消除算法来处理本地音频问题。</p>

    <p>
      对等连接内部影响最终媒体质量的因素大部分都是基于启发式的。这是一组特定的规则。因此，不同的实现可能会有不同的表现以及不同的媒体质量。
    </p>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss"></style>
